
/**
 *  ласс представл€ет собой слушатель класса WindowGraphics и предназначен дл€ объ€влени€ методов данного слушател€.
 *
 */
public class WindowGraphicsListener {
	
	/**
	 * ћетод дл€ объ€влени€ наблюдателю о том, что объект класса WindowGraphics 
	 * готов отправить выбранный файл на сервер.
	 */
	public void readyToSend () {
	}
	
	
	/**
	 * ћетод дл€ объ€влени€ наблюдателю о том, что объект класса WindowGraphics
	 * завершил попытку отправки файла на сервер.
	 */
	public void finished () {
	}
}
